[
    {
        "id": 3,
        "titlework": "SpeakTime",
        "description": "Avec SpeakTime, donnez à chacun la parole équitablement. Fixez la durée, ajoutez vos participants, et laissez l’application répartir le temps de parole automatiquement.",
        "cover": "https://gentle-pony-095b6f.netlify.app/speaktime.webp",
        "category": "React",
        "link": "https://github.com/SandraPautonnier/SpeakTime",
        "language": [
            "React",
            "/ Node.js avec Express"
        ],
        "tools": "Zustand"
    },
    {
        "id": 2,
        "titlework": "Le Mans School of AI",
        "description": "J'ai réalisé la refonte intégral du site web de Le Mans School of AI. C'est un groupe d'entraide pour les étudiants et professionnel autour de l'IA. J'ai conçu avec Javascript une gestion des évènements dynamiques : un évenement passé se mettra automatiquement dans la colonne Évènements passées",
        "cover": "https://gentle-pony-095b6f.netlify.app/lemansschoolofai.webp",
        "category": "Javascript",
        "link": "https://lemans-schoolofai.github.io/",
        "language": [
            "html css /",
            "Javascript"
        ],
        "tools": "Awesome"
    },    
    {
        "id": 1,
        "titlework": "Pulsar42",
        "description": "En juin 2025, j’ai participé au développement du site Pulsar42.sc, un projet collaboratif porté par une association autour du jeu Star Citizen. C’est l’un de mes premiers travaux en équipe sur un projet concret en TypeScript ! J’ai intégré le footer du site et ajouté la page des mentions légales, conforme au RGPD et à la LCEN. Ce projet m’a permis de consolider mes compétences en intégration front-end, en responsive design, et de collaborer avec d'autres développeurs dans un cadre associatif.",
        "cover": "https://gentle-pony-095b6f.netlify.app/pulsar42.webp",
        "category": "React",
        "link": "https://pulsar42.sc",
        "language": [
            "React"
        ],
        "tools": "Vite"
    },
    {
        "id": 4,
        "titlework": "Ohmyfood",
        "description": "Dans le cadre d’un projet fictif d’OpenClassrooms, Ohmyfood est une jeune startup qui voudrait s'imposer sur le marché de la restauration. Dans ce projet, ma mission est de développer l’interface mobile-first du site en intégrant une maquette fournie. J'ai utilisé Sass pour optimiser les styles, implémenté des animations CSS pour enrichir l’expérience utilisateur et assurer un design adaptatif. Le projet a été versionné avec Git et GitHub, me permettant de renforcer mes compétences en gestion de code et en collaboration.",
        "cover": "https://gentle-pony-095b6f.netlify.app/ohmyfood.webp",
        "category": "SASS",
        "link": "https://sandrapautonnier.github.io/ohmyfood/",
        "language": [
            "HTML/SCSS"
        ],
        "tools": "SASS"
    },
    {
        "id": 5,
        "titlework": "Kasa",
        "description": "Kasa est un projet fictif d'Openclassrooms représentant une entreprise de location d'appartements entre particuliers. J'ai développé le front-end de cette application en utilisant React et React Router pour une navigation fluide entre les pages. En suivant des maquettes et en manipulant des données simulées depuis un fichier JSON, j'ai conçu une interface réactive et moderne. J'ai initialisé le projet avec Create App React.",
        "cover": "https://gentle-pony-095b6f.netlify.app/kasa.webp",
        "category": "React",
        "link": "https://sandrapautonnier.github.io/kasa/",
        "language": [
            "React"
        ],
        "tools": "CRA"
    },
    {
        "id": 6,
        "titlework": "Argent bank",
        "description": "Dans le cadre d’un projet OpenClassrooms, Argent Bank, une nouvelle banque en ligne vise à s'imposer dans le secteur bancaire. En initialisant le projet avec Vite, j’ai développé le front-end d’une application bancaire avec React et Redux pour une expérience utilisateur dynamique. J’ai intégré le front-end avec le back-end via des appels API REST, assurant une communication fluide. En gérant l’état global avec Redux, j'ai conçu une application performante. J’ai également utilisé Swagger pour définir les points d’accès de l’API et Node.js pour exécuter le code côté serveur.",
        "cover": "https://gentle-pony-095b6f.netlify.app/argentbank.webp",
        "category": "React",
        "link": "https://github.com/SandraPautonnier/argentbank.git",
        "language": [
            "React /",
            "Redux"
        ],
        "tools": "Vite"
    }
    
    
]